emacs.org
* Terminal
** Setting default shell to ZSH
   #+BEGIN_SRC emacs-lisp
  (defvar my-term-shell "/bin/bash")
  (defadvice ansi-term (before force-bash)
    (interactive (list my-term-shell)))
   #+END_SRC
** Super-Enter opens ansi-term shell
   #+BEGIN_SRC emacs-lisp
(ad-activate 'ansi-term)
(global-set-key (kbd "<s-return>") 'ansi-term)
   #+END_SRC
** better-shell
   #+BEGIN_SRC emacs-lisp
(use-package better-shell
    :ensure t
    :bind (("C-'" . better-shell-shell)
           ("C-;" . better-shell-remote-open)))
   #+END_SRC
* Aliases
** Changin default response mode to a single char
   #+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
   #+END_SRC

* Org
** basic config
   #+BEGIN_SRC emacs-lisp 
  (setq org-src-window-setup 'current-window)
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
   #+END_SRC
** Org Bullets
   #+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))

   #+END_SRC

* Minor Settings
** clock
   #+BEGIN_SRC emacs-lisp
  (setq display-time-24hr-format t)
  (display-time-mode 1)
   #+END_SRC
** show line and column numbers on the mode line
   #+BEGIN_SRC emacs-lisp
  (line-number-mode 1)
  (column-number-mode 1)
   #+END_SRC
** bigger frame at startup
   #+BEGIN_SRC emacs-lisp
 (when window-system (set-frame-size (selected-frame) 160 40))
   #+END_SRC
** subword
   #+BEGIN_SRC emacs-lisp
(global-subword-mode 1)
   #+END_SRC
** electric
   #+BEGIN_SRC emacs-lisp
  (setq electric-pair-pairs '(
                              (?\( . ?\))
                              (?\[ . ?\])
                              (?\" . ?\")
                              (?\{ . ?\})
                              ))
  (electric-pair-mode t)
   #+END_SRC
** Scroll línea por línea
   #+BEGIN_SRC emacs-lisp
(setq scroll-conservatively 100)
   #+END_SRC
** Apagar campana
   #+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
   #+END_SRC
** Prettify Simbols
   #+BEGIN_SRC emacs-lisp
(when window-system (global-prettify-symbols-mode t))
   #+END_SRC
** Resalta momentáneamente la línea dónde se encuentra el cusor
   #+BEGIN_SRC emacs-lisp
(when window-system (global-hl-line-mode t))
   #+END_SRC

** Quita la barra de herramientas
   #+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
   #+END_SRC
** Formato de fecha
   #+BEGIN_SRC emacs-lisp
(setq-default org-display-custom-times t)
(setq org-time-stamp-custom-formats '("<%a %e %b %Y>" . "<%a %e %b %Y %H:%M>"))
   #+END_SRC
** Abrir archivo como root si es necesario
   #+BEGIN_SRC emacs-lisp
(defadvice ido-find-file (after find-file-sudo activate)
  "Find file as root if necessary."
  (unless (and buffer-file-name
               (file-writable-p buffer-file-name))
    (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))
   #+END_SRC
** Hide Menu bar
   #+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
   #+END_SRC
** Elisp rebinding
   (define-key lisp-interaction-mode-map (kbd "<C-return>") 'eval-last-sexp)
   (evil-define-key 'insert global-map (kbd "s-d") 'eval-last-sexp)
   (evil-define-key 'normal global-map (kbd "s-d") 'eval-defun)
* Packages
** swiper
   #+BEGIN_SRC emacs-lisp
  (use-package swiper
    :ensure t
    :config (global-set-key "\C-s" 'swiper))
   #+END_SRC
** which-key
   #+BEGIN_SRC emacs-lips
(use-package which-key
     :ensure t
     :init
     (which-key-mode))

   #+END_SRC
** beacon
   #+BEGIN_SRC emacs-lisp
(use-package beacon
  :ensure t
  :init
  (beacon-mode 1))

   #+END_SRC
** evil-mode
   #+BEGIN_SRC emacs-lisp
(use-package evil
:ensure t
:config)

  (add-to-list 'load-path "~/.emacs.d/evil")
  (require 'evil)
  (evil-mode 1)

(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))
  
  (use-package evil-leader
    :ensure t
    :config
    (global-evil-leader-mode))
    
  (use-package evil-indent-textobject
    :ensure t)
;; (require 'colemak-evil)
   #+END_SRC
** linum-mode
   #+BEGIN_SRC emacs-lisp

(use-package nlinum-relative
:ensure t    
:config
    ;; something else you want
    (nlinum-relative-setup-evil)
    (add-hook 'prog-mode-hook 'nlinum-relative-mode))

(require 'nlinum-relative)
(nlinum-relative-setup-evil)                    ;; setup for evil
(add-hook 'prog-mode-hook 'nlinum-relative-mode)
(setq nlinum-relative-redisplay-delay 0)      ;; delay
(setq nlinum-relative-current-symbol "")      ;; or "" for display current line number
(setq nlinum-relative-offset 0)                 ;; 1 if you want 0, 2, 3...
(nlinum-relative-on)
(global-nlinum-mode)

   #+END_SRC
** sudo edit
   #+BEGIN_SRC emacs-lisp
  (use-package sudo-edit
    :ensure t
    :bind("s-e" . sudo-edit))
   #+END_SRC
** ranger
   #+BEGIN_SRC emacs-lisp
(use-package ranger
:ensure t
)
   #+END_SRC
* IDO
** Enable ido mode
   #+BEGIN_SRC emacs-lisp
  (setq ido-enable-flex-matching nil)
  (setq ido-create-new-buffer 'always)
  ;;(setq ido-everywhere t)
  (ido-mode 1)
   #+END_SRC
** ido vertical
   #+BEGIN_SRC emacs-lisp
  (use-package ido-vertical-mode
    :ensure t
    :init
    (ido-vertical-mode 1))
  (setq ido-vertical-define-keys 'C-n-and-C-p-only)
   #+END_SRC
** smex
   #+BEGIN_SRC emacs-lisp
  (use-package smex
    :ensure t
    :init (smex-initialize)
    :bind
    ("M-x" . smex))
   #+END_SRC 
** switch buffers
   #+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ido-switch-buffer)
   #+END_SRC
* Buffers
** enable ibuffe
   #+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x b") 'ibuffer)
   #+END_SRC
** expert
   #+BEGIN_SRC emacs-lisp
  (setq ibuffer-expert t)
   #+END_SRC
** categories
   #+BEGIN_SRC emacs-lisp
   (setq ibuffer-saved-filter-groups
      (quote (("default"
	       ("dired" (mode . dired-mode))
	       ("org" (name . "^.*org$"))

	       ("config" (or
			       (name . "^.*config$")
			       (name . "^.*bashrc$")))
	       
		("web" (or (mode . web-mode) (mode . js2-mode)))
	       ("shell" (or (mode . eshell-mode) (mode . shell-mode)))
	       ("helm" (name . "\*helm\*"))
	       ("programming" (or
			       (mode . python-mode)
			       (mode . c++-mode)))
	       ("emacs" (or
			 (name . "^\\*scratch\\*$")
			 (name . "^\\*Messages\\*$")))
	       ))))
(add-hook 'ibuffer-mode-hook
	  (lambda ()
	    (ibuffer-auto-mode 1)
	    (ibuffer-switch-to-saved-filter-groups "default")))

;; don't show these
					;(add-to-list 'ibuffer-never-show-predicates "zowie")
;; Don't show filter groups if there are no buffers in that group
(setq ibuffer-show-empty-filter-groups nil)

;; Don't ask for confirmation to delete marked buffers
(setq ibuffer-expert t)
   #+END_SRC
* avy
  #+BEGIN_SRC emacs-lisp
  (use-package avy
    :ensure t
    :bind
    ("M-s" . avy-goto-char))
  #+END_SRC
* Config edit/reload
** edit
   #+BEGIN_SRC emacs-lisp
  (defun config-visit ()
    (interactive)
    (find-file "~/my-dot-files/emacs.org"))
  (global-set-key (kbd "C-c e") 'config-visit)
   #+END_SRC
** edit i3 configuration
   #+BEGIN_SRC emacs-lisp
(defun config-i3()
(interactive)
(find-file "~/.config/i3/config"))
(global-set-key (kbd "C-c i") 'config-i3)
   #+END_SRC
** edit bash configuration
   #+BEGIN_SRC emacs-lisp
(defun config-bash()
(interactive)
(find-file "~/.bashrc"))
(global-set-key (kbd "C-c b") 'config-bash)
   #+END_SRC
** reload
   #+BEGIN_SRC emacs-lisp
  (defun config-reload()
    (interactive)
    (org-babel-load-file (expand-file-name "~/my-dot-files/emacs.org")))
  (global-set-key (kbd "C-c r") 'config-reload)
   #+END_SRC
* rainbow
  #+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
    :ensure t
    :init (rainbow-mode 1))

    (use-package rainbow-delimiters
      :ensure t
      :init
      (rainbow-delimiters-mode 1))  
  #+END_SRC
* dashboard
  #+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
    (setq dashboard-items '((recents . 10)))
    (setq dashboard-banner-logo-title "Isma's Emacs!"))
  #+END_SRC
* switch-window
  #+BEGIN_SRC emacs-lisp
  (use-package switch-window
    :ensure t
    :config
    (setq switch-window-input-style 'minibuffer)
    (setq switch-window-increase 4)
    (setq switch-window-threshold 2)
    (setq switch-window-shortcut-style 'qwerty)
    (setq switch-window-qwerty-shortcuts
          '("a" "s" "d" "f" "h" "j" "k" "l"))
    :bind
    ([remap other-window] . switch-window))
  #+END_SRC
* window splitting function
  #+BEGIN_SRC emacs-lisp
  (defun split-and-follow-horizontally()
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))
  (global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

  (defun split-and-follow-vertically()
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))
  (global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
  #+END_SRC
* Javascript
  #+BEGIN_SRC emacs-lisp
(use-package js2-mode
:ensure t)
(require 'js2-mode)
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))

;; Better imenu
(add-hook 'js2-mode-hook #'js2-imenu-extras-mode)

(use-package js2-refactor
:ensure t)
(require 'js2-refactor)
(use-package xref-js2
:ensure t)
(require 'xref-js2)

(add-hook 'js2-mode-hook #'js2-refactor-mode)
(js2r-add-keybindings-with-prefix "C-c C-r")
(define-key js2-mode-map (kbd "C-k") #'js2r-kill)

;; js-mode (which js2 is based on) binds "M-." which conflicts with xref, so
;; unbind it.
(define-key js-mode-map (kbd "M-.") nil)

(add-hook 'js2-mode-hook (lambda ()
  (add-hook 'xref-backend-functions #'xref-js2-xref-backend nil t)))

(add-hook 'js2-mode-hook 'ac-js2-mode)
(setq ac-js2-evaluate-calls t)

  #+END_SRC
* auto completion
  #+BEGIN_SRC emacs-lisp
  (use-package company
    :ensure t
    :init
    (add-hook 'after-init-hook 'global-company-mode))
  #+END_SRC
* modeline
** spaceline
   #+BEGIN_SRC emacs-lisp
  (use-package spaceline
    :ensure t
    :config
    (require 'spaceline-config)
    (setq powerline-default-separator (quote arrow))
    (spaceline-spacemacs-theme))
   #+END_SRC
* dmenu
  #+BEGIN_SRC emacs-lisp
  (use-package dmenu
    :ensure t
    :bind
    ("s-SPC" . "dmenu"))
  #+END_SRC
* symon
  #+BEGIN_SRC emacs-lisp
  (use-package symon
    :ensure t
    :bind
    ("s-h" . symon-mode))
  #+END_SRC
* Export to bootstrap
  #+BEGIN_SRC emacs-lisp
(setq org-publish-project-alist
      '(("org-notes"
         :base-directory "~/org/"
         :publishing-directory "~/public_html/"
         :publishing-function org-twbs-publish-to-html
         :with-sub-superscript nil
         )))


(defun my-org-publish-buffer ()
  (interactive)
  (save-buffer)
  (save-excursion (org-publish-current-file))
  (let* ((proj (org-publish-get-project-from-filename buffer-file-name))
         (proj-plist (cdr proj))
         (rel (file-relative-name buffer-file-name
                                  (plist-get proj-plist :base-directory)))
         (dest (plist-get proj-plist :publishing-directory)))
    (browse-url (concat "file://"
                        (file-name-as-directory (expand-file-name dest))
                        (file-name-sans-extension rel)
                        ".html"))))
  #+END_SRC
  <<<<<<< HEAD
* Emmet support
  #+BEGIN_SRC emacs-lisp
(add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
(add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.
  #+END_SRC
* Killring Menu
  #+BEGIN_SRC emacs-lisp
  (use-package popup-kill-ring
    :ensure t
    :bind ("M-y" . popup-kill-ring))
  #+END_SRC

* Markdown
  #+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t)
  #+END_SRC
* Start emacs server (because of reasons)
  #+BEGIN_SRC emacs-lisp
    (server-start)
  #+END_SRC
* Saving emacs state
  #+BEGIN_SRC emacs-lisp
(desktop-save-mode 1)
  #+END_SRC

* Eyebrowse for managing windows
#+BEGIN_SRC emacs-lisp
  (use-package eyebrowse
    :ensure t)
  (eyebrowse-mode t)
#+END_SRC
* Helm
#+BEGIN_SRC emacs-lisp
(use-package helm
:ensure t)
(helm-mode t)
(global-set-key (kbd "M-x") #'helm-M-x)
(global-set-key (kbd "C-x r b") #'helm-filtered-bookmarks)
(global-set-key (kbd "C-x C-f") #'helm-find-files)
#+END_SRC
